benchmarking-results/mongodb_load.dat
/usr/bin/java  -classpath /home/azureadmin/Transactional-YCSB/conf:/home/azureadmin/Transactional-YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/azureadmin/Transactional-YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/azureadmin/Transactional-YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/azureadmin/Transactional-YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/azureadmin/Transactional-YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/azureadmin/Transactional-YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/azureadmin/Transactional-YCSB/mongodb/target/dependency/bson-5.1.0.jar:/home/azureadmin/Transactional-YCSB/mongodb/target/dependency/bson-record-codec-5.1.0.jar:/home/azureadmin/Transactional-YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/home/azureadmin/Transactional-YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/home/azureadmin/Transactional-YCSB/mongodb/target/dependency/mongodb-driver-core-5.1.0.jar:/home/azureadmin/Transactional-YCSB/mongodb/target/dependency/mongodb-driver-sync-5.1.0.jar:/home/azureadmin/Transactional-YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/azureadmin/Transactional-YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloadt -threads 10 -p mongodb.url=mongodb://10.0.2.6:27017/ycsb
mongo client connection created with mongodb://10.0.2.6:27017/ycsb
[OVERALL], RunTime(ms), 3261436
[OVERALL], Throughput(ops/sec), 1533.067029369885
[TOTAL_GCS_G1_Young_Generation], Count, 3313
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 5129
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.15726201587276278
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3313
[TOTAL_GC_TIME], Time(ms), 5129
[TOTAL_GC_TIME_%], Time(%), 0.15726201587276278
[COMMIT], Operations, 5000000
[COMMIT], AverageLatency(us), 4869.6870494
[COMMIT], MinLatency(us), 1732
[COMMIT], MaxLatency(us), 1652735
[COMMIT], 95thPercentileLatency(us), 6575
[COMMIT], 99thPercentileLatency(us), 11207
[COMMIT], Return=OK, 5000000
[COMMIT], Return=ERROR, 9
[COMMIT-FAILED], Operations, 9
[COMMIT-FAILED], AverageLatency(us), 101820.44444444444
[COMMIT-FAILED], MinLatency(us), 87680
[COMMIT-FAILED], MaxLatency(us), 118399
[COMMIT-FAILED], 95thPercentileLatency(us), 118399
[COMMIT-FAILED], 99thPercentileLatency(us), 118399
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 1435.1
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 14335
[CLEANUP], 95thPercentileLatency(us), 14335
[CLEANUP], 99thPercentileLatency(us), 14335
[START], Operations, 5000009
[START], AverageLatency(us), 0.0987312222837999
[START], MinLatency(us), 0
[START], MaxLatency(us), 19551
[START], 95thPercentileLatency(us), 0
[START], 99thPercentileLatency(us), 0
[START], Return=OK, 5000009
[INSERT], Operations, 5000009
[INSERT], AverageLatency(us), 1631.1982080432256
[INSERT], MinLatency(us), 614
[INSERT], MaxLatency(us), 300543
[INSERT], 95thPercentileLatency(us), 3193
[INSERT], 99thPercentileLatency(us), 5931
[INSERT], Return=OK, 5000009