benchmarking-results/orientdb_e1.dat
/usr/bin/java  -classpath /home/azureadmin/YCSB/conf:/home/azureadmin/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/azureadmin/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/azureadmin/YCSB/orientdb/target/orientdb-binding-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-analysis-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-commons-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-tree-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-util-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/commons-lang-2.6.jar:/home/azureadmin/YCSB/orientdb/target/dependency/concurrentlinkedhashmap-lru-1.4.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/hppc-0.8.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/icu4j-65.1.jar:/home/azureadmin/YCSB/orientdb/target/dependency/javax.activation-api-1.2.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9-native.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-a64asm-1.0.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-constants-0.10.3.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-ffi-2.2.11.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-posix-3.1.15.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-x86asm-1.0.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/log4j-1.2.17.jar:/home/azureadmin/YCSB/orientdb/target/dependency/lz4-java-1.4.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-client-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-core-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-api-1.7.25.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-log4j12-1.7.10.jar site.ycsb.Client -t -db site.ycsb.db.OrientDBClient -s -P workloads/workloadt -p orientdb.url=remote:database-vm-0/test -p orientdb.server.user=root -p orientdb.server.password=rootpwd -p orientdb.user=root -p orientdb.password=rootpwd -threads 10 -p requestdistribution=uniform -p operationcount=300000 -p transactionReadCount=9 -p transactionUpdateCount=1
[OVERALL], RunTime(ms), 2512780
[OVERALL], Throughput(ops/sec), 119.3896799560646
[TOTAL_GCS_G1_Young_Generation], Count, 631
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1389
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.05527742181965791
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 631
[TOTAL_GC_TIME], Time(ms), 1389
[TOTAL_GC_TIME_%], Time(%), 0.05527742181965791
[READ], Operations, 2700000
[READ], AverageLatency(us), 6201.3202248148145
[READ], MinLatency(us), 549
[READ], MaxLatency(us), 456703
[READ], 95thPercentileLatency(us), 29071
[READ], 99thPercentileLatency(us), 44351
[READ], Return=OK, 2700000
[COMMIT], Operations, 300000
[COMMIT], AverageLatency(us), 16472.10925
[COMMIT], MinLatency(us), 1895
[COMMIT], MaxLatency(us), 1654783
[COMMIT], 95thPercentileLatency(us), 42047
[COMMIT], 99thPercentileLatency(us), 230655
[COMMIT], Return=OK, 300000
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 3121.2
[CLEANUP], MinLatency(us), 1142
[CLEANUP], MaxLatency(us), 12487
[CLEANUP], 95thPercentileLatency(us), 12487
[CLEANUP], 99thPercentileLatency(us), 12487
[START], Operations, 300000
[START], AverageLatency(us), 0.09109666666666667
[START], MinLatency(us), 0
[START], MaxLatency(us), 1685
[START], 95thPercentileLatency(us), 1
[START], 99thPercentileLatency(us), 1
[START], Return=OK, 300000
[UPDATE], Operations, 300000
[UPDATE], AverageLatency(us), 9115.621186666667
[UPDATE], MinLatency(us), 1446
[UPDATE], MaxLatency(us), 444927
[UPDATE], 95thPercentileLatency(us), 33343
[UPDATE], 99thPercentileLatency(us), 47711
[UPDATE], Return=OK, 300000