benchmarking-results/orientdb_e2.dat
/usr/bin/java  -classpath /home/azureadmin/YCSB/conf:/home/azureadmin/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/azureadmin/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/azureadmin/YCSB/orientdb/target/orientdb-binding-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-analysis-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-commons-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-tree-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-util-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/commons-lang-2.6.jar:/home/azureadmin/YCSB/orientdb/target/dependency/concurrentlinkedhashmap-lru-1.4.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/hppc-0.8.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/icu4j-65.1.jar:/home/azureadmin/YCSB/orientdb/target/dependency/javax.activation-api-1.2.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9-native.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-a64asm-1.0.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-constants-0.10.3.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-ffi-2.2.11.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-posix-3.1.15.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-x86asm-1.0.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/log4j-1.2.17.jar:/home/azureadmin/YCSB/orientdb/target/dependency/lz4-java-1.4.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-client-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-core-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-api-1.7.25.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-log4j12-1.7.10.jar site.ycsb.Client -t -db site.ycsb.db.OrientDBClient -s -P workloads/workloadt -p orientdb.url=remote:database-vm-0/test -p orientdb.server.user=root -p orientdb.server.password=rootpwd -p orientdb.user=root -p orientdb.password=rootpwd -threads 10 -p requestdistribution=zipfian -p operationcount=300000 -p transactionReadCount=9 -p transactionUpdateCount=1
[OVERALL], RunTime(ms), 1570961
[OVERALL], Throughput(ops/sec), 190.9659119481642
[TOTAL_GCS_G1_Young_Generation], Count, 659
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1710
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.1088505698104536
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 659
[TOTAL_GC_TIME], Time(ms), 1710
[TOTAL_GC_TIME_%], Time(%), 0.1088505698104536
[READ], Operations, 2700000
[READ], AverageLatency(us), 3678.3423837037035
[READ], MinLatency(us), 441
[READ], MaxLatency(us), 441855
[READ], 95thPercentileLatency(us), 16847
[READ], 99thPercentileLatency(us), 33503
[READ], Return=OK, 2700000
[COMMIT], Operations, 298470
[COMMIT], AverageLatency(us), 11167.369584882903
[COMMIT], MinLatency(us), 1646
[COMMIT], MaxLatency(us), 978431
[COMMIT], 95thPercentileLatency(us), 29471
[COMMIT], 99thPercentileLatency(us), 152703
[COMMIT], Return=OK, 298470
[COMMIT], Return=ERROR, 1530
[COMMIT-FAILED], Operations, 1530
[COMMIT-FAILED], AverageLatency(us), 240245.4751633987
[COMMIT-FAILED], MinLatency(us), 1844
[COMMIT-FAILED], MaxLatency(us), 2062335
[COMMIT-FAILED], 95thPercentileLatency(us), 941055
[COMMIT-FAILED], 99thPercentileLatency(us), 1154047
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 2918.0
[CLEANUP], MinLatency(us), 1281
[CLEANUP], MaxLatency(us), 7763
[CLEANUP], 95thPercentileLatency(us), 7763
[CLEANUP], 99thPercentileLatency(us), 7763
[START], Operations, 300000
[START], AverageLatency(us), 0.5747733333333334
[START], MinLatency(us), 0
[START], MaxLatency(us), 58175
[START], 95thPercentileLatency(us), 0
[START], 99thPercentileLatency(us), 1
[START], Return=OK, 300000
[UPDATE], Operations, 300000
[UPDATE], AverageLatency(us), 5598.4697166666665
[UPDATE], MinLatency(us), 1166
[UPDATE], MaxLatency(us), 396799
[UPDATE], 95thPercentileLatency(us), 20543
[UPDATE], 99thPercentileLatency(us), 36735
[UPDATE], Return=OK, 300000